frontend/widgets/tags/TagWidget.php

SELECT * FROM `tags` ORDER BY `post_num` DESC LIMIT 20
---
	public function run()
	{
		$res = TagModel::find()
			-> orderBy(['post_num' => SORT_DESC])
			-> limit($this -> limit)
			-> all();