frontend/models/PostForm.php

	public function getViewByID($id)
	{
		$res = PostModel::find() -> with('relate.tag', 'extend') -> where(['id' => $id]) -> asArray() -> one();
---
SELECT * FROM `post_extends` WHERE `post_id`='12'
SELECT * FROM `posts` WHERE `id`='12'
SELECT * FROM `tags` WHERE `id` IN ('3', '8')